from pandas import *
import csv

# charset=[',', '', '.', '', '?', '', 'ం', '',
#          'ః', '', 'అ', '', 'ఆ', '', 'ఇ', '', 'ఈ', '', 'ఉ', '', 'ఊ', '', 'ఋ', 
#          '', 'ఎ', '', 'ఏ', '', 'ఐ', '', 'ఒ', '', 'ఓ', '', 'ఔ', '', 'క', '', 'ఖ', 
#          '', 'గ', '', 'ఘ', '', 'చ', '', 'ఛ', '', 'జ', '', 'ఞ', '', 'ట', '', 'ఠ', '', 
#          'డ', '', 'ఢ', '', 'ణ', '', 'త', '', 'థ', '', 'ద', '', 'ధ', '', 'న', '', 
#          'ప', '', 'ఫ', '', 'బ', '', 'భ', '', 'మ', '', 'య', '', 'ర', '', 'ల', 
#          '', 'ళ', '', 'వ', '', 'శ', '', 'ష', '', 'స', '', 'హ', '', 'ా', '', 'ి',
#          '', 'ీ', '', 'ు', '', 'ూ', '', 'ృ', '', 'ె', '', 'ే', '', 'ై', '', 'ొ', '',
#          'ో', '', 'ౌ', '', '్']
# charlist=[',', '', '.', '', '?', '', 'ँ', '', 'ं', '', 'ः', '', 'अ', '', 'आ', '', 'इ', '', 'ई', '', 'उ', '', 
#           'ऊ', '', 'ऋ', '', 'ए', '', 'ऐ', '', 'ऑ', '', 'ओ', '', 'औ', '', 'क', '', 'ख', '', 'ग', '', 'घ', '', 'च', 
#           '', 'छ', '', 'ज', '', 'झ', '', 'ञ', '', 'ट', '', 'ठ', '', 'ड', '', 'ढ', '', 'ण', '', 'त', '', 'थ', '', 'द',
#           '', 'ध', '', 'न', '', 'प', '', 'फ', '', 'ब', '', 'भ', '', 'म', '', 'य', '', 'र', '', 'ल', '', 'व', '', 'श', '', 
#           'ष', '', 'स', '', 'ह', '', 'ऽ', '', 'ा', '', 'ि', '', 'ी', '', 'ु', '', 'ू', '', 'ृ', '', 'े', '', 'ै', '', 
#           'ॉ', '', 'ो', '', 'ौ', '', '्', '', 'क़', '', 'ख़', '', 'ज़', '', 'ड़', '', 'ढ़', '', 'फ़']
charset=[',', '', '.', '', '?', '', 'ँ', '', 'ं', '', 'ः', '', 'अ', '', 'आ', '', 'इ', '', 'ई', '', 'उ', '',
         'ऊ', '', 'ऋ', '', 'ए', '', 'ऐ', '', 'ऑ', '', 'ओ', '', 'औ', '', 'क', '', 'ख', '', 'ग', '', 'घ', '', 'ङ', 
         '', 'च', '', 'छ', '', 'ज', '', 'झ', '', 'ञ', '', 'ट', '', 'ठ', '', 'ड', '', 'ढ', '', 'ण', '', 'त', '', 'थ',
         '', 'द', '', 'ध', '', 'न', '', 'प', '', 'फ', '', 'ब', '', 'भ', '', 'म', '', 'य', '', 'र', '', 'ल', '', 'व', '', 
         'श', '', 'ष', '', 'स', '', 'ह', '', 'ऽ', '', 'ा', '', 'ि', '', 'ी', '', 'ु', '', 'ू', '', 'ृ', '', 'ॅ', '', 'े', 
         '', 'ै', '', 'ॉ', '', 'ो', '', 'ौ', '', '्', '', 'क़', '', 'ख़', '', 'ग़', '', 'ज़', '', 'ड़', '', 'ढ़', '', 'फ़']
#print(len(charset))
charset = set(charset)
#print(len(charset))

# with open("telugu_data_new.csv",'w') as file:
# with open("bhoj_data_new.csv",'w') as file:
# with open("mt_data_new.csv",'w') as file:
with open("bhoj_d3_new.csv",'w') as file:
      writer=csv.writer(file)
      writer.writerow(["Code","Text","Language","Dialect","No. of char","No. of words","Category"])
      # for j in {1,2,3}:
      fname="Dataset given/text_bh - D3.csv"
      # fname="text_te - D4.csv"
      data = read_csv(fname)
      sentences = data['SENT'].tolist()
      codes= data['CODE'].tolist()
      for i in range(0,len(codes)):
            s=""
            l=codes[i].split("_")
            if len(l)<3:
                  continue
            cat=l[-2]
            if cat=="AG":
                  cat="Agriculture"
            elif cat=="F":
                  cat="Finance"
            f=0
            ch=0
            words=0
            if sentences[i]=="A sentence unrelated to the topic" or sentences[i]=="Repeated sentence" or sentences[i]=="Incomplete":
                  continue
            l=['8', 'b', 'o',  '4', '5', '0', 'A', 'B', 'C', 'N', 
            'P', 'K', 'i', 'p', 'c', 'h', 'n', 'a', 'r', 'u', 't' , '2','1','F','D','7', 's', 
            '3', 'l' ,'j', 'e', 'v', '6', '9', 'R', 'm',  '2', '1', '3', '5', '4', '7']
            # '*', '\xa0', '\u200c', '\u200d', '\r', '\n', '\u200e', '-', '\u200b', '!', '$', '_',  '\t']
            # for a in l:
            #       if a in sentences[i]:
            #             f=1
            l2=['(', '', ')', '', ',', '', '-', '', '.', '', '/',';',"'", '-',
            '౦', '\u200c', '\xa0','\u200b','\u200e','\u200d',':','|','!','‘', '–', '—','=', '"', '“', '”',
            'h', 'e', 'c', 'g', 'H', 'ü', 'l', 'k', 'u', 't', 'r', 'J', 'a', 's', 'm', 'i', 'n', 'b','A',
            'p', '&', '9', 'o', 'Z', 'y', 'P', 'L', 'I', 'q', 'α', 'v', 'N', 'C', '8', 'B', 'x', 'M', 'd', 'O', 
            'D', 'F','*', '\xa0', '\u200c', '\u200d', '\r', '\n', '\u200e', '-', '\u200b', '!', '$', '_',  '\t', 
            '%', "'", '—', '[', ']', ';', '+','_','*',  '|', ':','&','\r', '\n','$','"','\\','\t', '’', '।', 
            '‘','–','`','’','।','१']
            # for a in l2:
            #       if a in sentences[i]:
            #             s.replace(a,' ')
            if str(sentences[i])!='nan':
                  for x in sentences[i]:
                        if x in l:
                              f=1
                        elif x in l2:
                              s= s+ " "
                        else:
                              s=s+ x
                  for x in sentences[i]:
                        if(x!=" "):
                              ch=ch +1;
                        else:
                              words=words+1
                  if f==0:
                        writer.writerow([codes[i],s,"Bhojpuri","D3",ch,words,cat])
      file.close()